test/cwmp_builder_SUITE_data/cwmp_SetParameterAttributes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header/><soapenv:Body><cwmp:SetParameterAttributes><SetParameterAttributesList soapenc:arrayType="cwmp:SetParameterAttributesStruct[1]"><cwmp:SetParameterAttributesStruct><Name/><NotificationChange>true</NotificationChange><ParameterAttributeNotificationValueType>1</ParameterAttributeNotificationValueType><AccessListChange>false</AccessListChange><AccessList soapenc:arrayType="xsd:string[2]"><string>1</string><string>2</string></AccessList></cwmp:SetParameterAttributesStruct></SetParameterAttributesList></cwmp:SetParameterAttributes></soapenv:Body></soapenv:Envelope>